app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."id" ASC
---
  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = 'Book was successfully created.'
      redirect_to book_path(@book.id)
    else
      @books = Book.all.order(id: :ASC)