app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
---
  def index
    @books = Book.all

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "リーダブルコード1"], ["body", "html"], ["created_at", "2020-07-08 02:47:47.426159"], ["updated_at", "2020-07-08 02:47:47.426159"]]
---
  def create
    book = Book.new(book_params)
    book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "htmlcss"], ["updated_at", "2020-07-08 02:48:10.579271"], ["id", 19]]
---
  def update
    book = Book.find(params[:id])
    book.update(book_params)